{"version":"1.0","provider_name":"LifeLink","provider_url":"https:\/\/lifelinkhealthtech.com","author_name":"root","author_url":"https:\/\/lifelinkhealthtech.com\/author\/root\/","title":"Terms of Service - LifeLink","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"CJidlaTyY5\"><a href=\"https:\/\/lifelinkhealthtech.com\/terms-of-service\/\">Terms of Service<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/lifelinkhealthtech.com\/terms-of-service\/embed\/#?secret=CJidlaTyY5\" width=\"600\" height=\"338\" title=\"&#8220;Terms of Service&#8221; &#8212; LifeLink\" data-secret=\"CJidlaTyY5\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n<\/script>\n","description":"Terms of Service My Staff Need Effective Date: March 24, 2025 Welcome to My Staff Need. These Terms of Service govern your use of our website (www.kpgnursing.com) and the services provided by My Staff Need (&#8220;we,&#8221; &#8220;us,&#8221; or &#8220;our&#8221;). By accessing or using our website, you agree to be bound by these Terms of Service. If you do not agree to these terms, please do not use our website. 1. Introduction These Terms of Service constitute a legally binding agreement between you and My Staff Need regarding your use of our website and services. By using our website, you confirm that you are at least 18 years of age. If you do not meet this requirement, you must not use our services. 2. License to Use the Website Unless otherwise stated, My Staff Need and\/or its licensors own the intellectual property rights for all content on this website. You may: View, download (for caching purposes only), and print pages for personal use, subject to the restrictions below. You must not: Republish material from this website (print or digital media included). Sell, rent, or sub-license material from the website. Reproduce, duplicate, or copy material for commercial purposes. Modify or redistribute any content unless explicitly authorized. Use frames or scraping techniques to republish content. Where content is explicitly made available for redistribution, it may only be shared within your organization. 3. Acceptable Use You agree not to use this website in ways that: Cause damage or impair its availability. Are unlawful, fraudulent, or harmful. Distribute malware, spyware, viruses, or other malicious software. Collect data systematically without permission (e.g., data mining, scraping). Engage in unsolicited commercial communications. Violate the rights of others. 4. Restricted Access My Staff Need reserves the right to restrict access to certain sections of the website. If provided with a user ID and password, you must keep them confidential. We may disable your access at our sole discretion without notice. 5. User Content Any content you submit (text, images, videos, etc.) grants us a worldwide, irrevocable, non-exclusive, royalty-free license to use, publish, and distribute it. Your content must not be illegal, infringe any third-party rights, or be the subject of legal proceedings. We reserve the right to remove or edit any content at our discretion. 6. No Warranties This website is provided &#8220;as is&#8221; without warranties. We do not guarantee that: The website will always be available. The information on the website is accurate, complete, or non-misleading. The content on this website does not constitute professional advice. If you need legal, financial, or medical advice, consult a qualified professional. 7. Limitations of Liability My Staff Need will not be liable for: Any direct, indirect, or consequential losses related to website use. Business losses, revenue loss, or data corruption. These limitations apply even if we were advised of potential losses. 8. Exceptions and Reasonableness Nothing in these terms will exclude liabilities that cannot be legally limited, including: Death or personal injury due to negligence. Fraud or fraudulent misrepresentation. Any matter deemed unlawful to exclude. If you do not agree with these exclusions and limitations, you should not use our website. 9. Indemnity You agree to indemnify and hold My Staff Need harmless against any claims, damages, or expenses arising from your breach of these terms. 10. Breaches of These Terms If you violate these Terms of Service, we may: Suspend or permanently ban your access. Block your IP address. Take legal action against you. 11. Changes to These Terms We may revise these terms at any time. Changes take effect upon posting. Please review this page regularly to stay updated. 12. Assignment My Staff Need may transfer or subcontract its rights and obligations without notice. You may not transfer your rights without our consent. 13. Severability If any part of these terms is deemed unenforceable, the rest will remain in effect. 14. Entire Agreement These Terms of Service and our Privacy Policy constitute the entire agreement between you and My Staff Need regarding website use, replacing any prior agreements. 15. Governing Law and Jurisdiction These terms are governed by the laws of Scottsdale, AZ. Any disputes will be resolved in Scottsdale, AZ courts. 16. Contact Information For any questions regarding these terms, please contact us: My Staff Need LLC1603 Capitol Ave, Suite 413g-1061Cheyenne, WY 82001Email: info@lifelinkhealthtech.comPhone: +1 411 211 4211 Thank you for using My Staff Need."}