{"version":"1.0","provider_name":"LifeLink","provider_url":"https:\/\/lifelinkhealthtech.com","author_name":"root","author_url":"https:\/\/lifelinkhealthtech.com\/author\/root\/","title":"Our Expertise - LifeLink","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"pzNUm8W0J7\"><a href=\"https:\/\/lifelinkhealthtech.com\/our-expertise\/\">Our Expertise<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/lifelinkhealthtech.com\/our-expertise\/embed\/#?secret=pzNUm8W0J7\" width=\"600\" height=\"338\" title=\"&#8220;Our Expertise&#8221; &#8212; LifeLink\" data-secret=\"pzNUm8W0J7\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n<\/script>\n","description":"Our Expertise Empowering Healthcare with Expertise, Innovation, and Reliable Workforce Solutions. Administrative Support Are you a Healthcare facility that requires a patient coordinator; a Facility Director who needs an efficient staffing manager; a clinic that needs a Greeter to meet and greet; or a remarkable candidate looking for the next assignment? our authoritative recruitment team will ensure that each step of the process is calculated and produces effective results for all parties involved. My Staff Need is committed to providing our clients with customized services that are consistent with the top standards in the business. We have a successful track record of providing healthcare administrative support including: Receptionist\/Greeter Nursing directors Intake Coordinator Patient Enrollment Specialist Credentialing Specialist Administrative Assistants Patient Access Representative Human resources https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/administraive-1.mp4 Allied Health Our Allied Health practice focuses in placing a wide array of diagnostic, technical, therapeutic, and direct patient care healthcare professionals. My Staff Need’s Vision is to provide top talent to healthcare facilities who need a wide array of healthcare professionals. we provide staffing services to hospitals, clinics, offices, rehabilitation centers, laboratories, and research centers. The roles that we provide manpower to are: Occupational Therapist Phlebotomist Physical Therapist Radiographer Respiratory Therapist Social Worker Dental Assistant Sterile Processing Technician Surgical Technologist Dietician\/Nutritionist Environmental Services Laboratory Technician Medical Assistant Medical Coder Medical Transcriptionist Sonographer Specimen Processor https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/ailled-1.mp4 Clinical Research At My Staff Need, we have a dedicated team of staffing professionals dedicated to staffing clinical research professionals ranging in experience from entry- to Doctorate levels in part- and full-time, contract, project-based, or direct hire roles With experience in placing suitable clinical research professionals across multitude of diverse opportunities in all areas, we prosper in connecting candidates with the right opportunity, flexibility, and stability they deserve at work. we support the following areas and associated skill sets include but are not limited to the following roles: Clinical Research Trial Assistant Data Management Enrollment Assistant Study Coordinator Clinical Research Coordinator (CRC) Clinical Research Associate (CRA) Clinical Research Nurse https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/reseacrh-1.mp4 Executive My Staff Need has an exclusive group of recruiters that focuses dedicatedly on providing healthcare facilities and clinics with top executives. The Executive recruitment team of My Staff Need works on supplying candidates responsible for planning, directing, and coordinating the administrative and financial services throughout all healthcare verticals including hospitals, home care agencies, managed care companies, community health\/social service organizations, and outpatient settings. We focus on building relationships that lasts and grow for both our candidates and our clients. We aim on placing executives and administrators in the following areas: Supervisor Unit Manager Unit Administrator Director Revenue Cycle Management Finance Manager\/Analyst\/Director C-Level Our consistent expectation in finding top talent on a contract or direct hire basis to manage, direct, or oversee healthcare facilities and departments goes unmatched. https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/executive-1.mp4 Healthcare IT Our Information Technology recruitment team partners with corporations in need of technology staffing, recruiting, and consulting solutions. we can offer customized and tailored solutions to each of our clients from small enterprises to global businesses. We supply both technical and functional talent across the healthcare industry in below areas including: Application and Software Development Infrastructure Healthcare IT Project and Program Management Quality Assurance and Testing Business Intelligence and Analytics Data Warehousing and Big Data Information Security https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/healthcare-itt-1.mp4 Human Resources As Businesses grow and need to scale up, a reliance on effective hiring and recruiting is required to meet the demands of expansion. The Human Resources recruitment division at My Staff Need understands the need of finding experienced HR professionals who can build a steady pipeline of quality talent. From heads of human resources to generalists and specialists, we focus on placing these experts in the following areas: Employment, Placement, and Personal Planning Learning and Development Compensation and Benefits Health, Safety, and Security Employee and Labor Relations Employee and Labor Relations Management Practices https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/human_res-1.mp4 Laboratory our laboratory staff recruitment division offers permanent placement solutions for candidates at leading university teaching hospitals, small rural hospitals, reference laboratories, and pharmaceutical companies nationwide. Our focus is on finding candidates and opportunities that align to create shared positive outcomes for your organization. No Matter if you are a large teaching hospital, reference laboratory, rural hospital, or a pharmaceutical company looking for experienced laboratory staff or looking to open a new laboratory, we are here to help. Positions that we specialize in: Pathologist Pathologist Assistant Anatomic Pathology Manager Histology Manager Cytology Manager Histotechnologist Cytotechnologist Cytogenetic Technologist Laboratory Administrative Director Laboratory Manager Laboratory Supervisor Laboratory Technician https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/labratory-1.mp4 Mental Health\/Social Services Our mental Health services are focused towards creating a more effective community to promote equality and opportunity for the underserved population. The Social Work\/Mental Health recruitment division at My Staff Need focuses on finding candidates that thrive on ensuring the people are well served. The Sourcers who specialize in this practice are dedicated to sourcing talent that are knowledgeable of the rules and regulations in this sector. we are determined on finding candidates that truly enjoy helping people. Below are some of the roles we work on: LCSW and LMSW Psychologis Case Planner and Case Manager LCSW and LMSW Psychologis Case Planner and Case Manager https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/mental-1.mp4 Nursing and Advanced Practice The Nursing and Advanced Practice staffing practice of My Staff Need is a niche recruitment practice dedicated to providing skilled nurses to our healthcare clients. We take great pride in our dependability to provide the best available talent within industry. Our recruitment experts have successfully matched contract and direct hire candidates for a wide array of clients across the United States. There are numerous nursing specialties that our recruitment team focuses on be it the top tier nurse practitioners, registered nurses, licensed practical nurses\/vocational nurses, and certified nursing assistants. These roles can be placed in a variety of settings including assisted living facilities, long-term care facilities, specialty clinics, hospitals, chemical dependency facilities, non-clinical settings, and rehabilitation facilities. Non-Direct Patient Care Nursing Roles Include (not limited to): Managed Care Utilization Review\/Case Management Telephonic Director Management Direct Patient Care Nursing Roles Include (not limited to): Intensive Care Emergency Room Behavioral Health and Psychiatric Cardiac","thumbnail_url":"https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2021\/03\/01.png","thumbnail_width":120,"thumbnail_height":120}