{"version":"1.0","provider_name":"LifeLink","provider_url":"https:\/\/lifelinkhealthtech.com","author_name":"root","author_url":"https:\/\/lifelinkhealthtech.com\/author\/root\/","title":"Allied Health - LifeLink","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"cwTFpTeUuW\"><a href=\"https:\/\/lifelinkhealthtech.com\/allied-health\/\">Allied Health<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/lifelinkhealthtech.com\/allied-health\/embed\/#?secret=cwTFpTeUuW\" width=\"600\" height=\"338\" title=\"&#8220;Allied Health&#8221; &#8212; LifeLink\" data-secret=\"cwTFpTeUuW\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n<\/script>\n","description":"Allied Health Jobs Innovating Allied Health for a Stronger, Healthier Future! What is allied health? Allied health professionals play an important role in the healthcare industry, providing invaluable support to medical professionals and patients. Allied health is a broad field describing professionals who support the medical community in a variety of ways, from direct patient care to essential administrative services.  If you are looking for an allied health job, working with Lifelink Healthcare Staffing agency can help you maximize the value of your healthcare experience. With our dedication to offering a wide variety of positions, you&#8217;re sure to be able to find the perfect fit for your experience and credentials. From contract work, temp to perm opportunities, and direct hire jobs, our recruiters work with you to find the allied health job that best meets your needs. Learn more A few well-known allied health positions include CT technologists, radiology technologists, certified surgical techs, sterile processing techs, medical assistants, phlebotomists, and respiratory therapists. Together these important roles make up an estimated 60% of the healthcare workforce across the country and have a profound effect on overall patient well-being.  Our commitment to helping you find top-tier healthcare jobs means that you have the opportunity to establish lasting relationships with premier hospitals, surgery centers, physician offices, medical centers, and clinics in your desired location. Start your allied health career with Lifelink today! Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/ailled-health3-1.mp4 Explore allied health jobs with Lifelink With over 40 years of experience staffing a wide range of allied health roles, Lifelink Healthcare Staffing is the perfect choice allied health professionals nationwide. Our team of expert recruiters are eager to help you find the perfect role that caters to your skills and qualifications, whether it&#8217;s within rehabilitation facilities, surgical centers, long-term acute care, or other areas. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/ailled-health4.mp4 MSP vs VMS Overview Rehab and therapy Radiology and imaging Surgical services Behavioral health and social work Laboratory Pharmacy Dental Emergency services Traditional Method Technology Based VMS Managed Services (MSP) Occupational therapist Speech language pathologist Speech language therapist Physical therapist Respiratory therapist Therapy assistant Traditional Method Technology Based VMS Managed Services (MSP) Cardiovascular radiology tech Endoscopy tech Radiation therapist Cath lab technologist EP lab tech Radiology technologist CT technologist Interventional radiology tech Ultrasound tech Echo technologist Mammographer Vascular technologist EEG &amp; EKG tech MRI tech X-ray tech Nuclear med tech Traditional Method Technology Based VMS Managed Services (MSP) Anesthesia tech Certified surgical tech Sterile processing tech Cardiovascular operating room tech Operating room tech Surgical first assistant Traditional Method Technology Based VMS Managed Services (MSP) Case manager Counselor Social worker Clinician Mental health tech Traditional Method Technology Based VMS Managed Services (MSP) Cytotechnologist Medical laboratory tech Medical technologist Histotechnologist Medical laboratory scientist Pathology assistant Lab assistant Traditional Method Technology Based VMS Managed Services (MSP) Pharmacist Pharmacy tech Traditional Method Technology Based VMS Managed Services (MSP) Dental assistant Dental hygienist Traditional Method Technology Based VMS Managed Services (MSP) Emergency medical tech Emergency room tech Paramedic Traditional Method Technology Based VMS Managed Services (MSP) Occupational therapist Speech language pathologist Speech language therapist Physical therapist Respiratory therapist Therapy assistant Traditional Method Technology Based VMS Managed Services (MSP) Cardiovascular radiology tech Endoscopy tech Radiation therapist Cath lab technologist EP lab tech Radiology technologist CT technologist Interventional radiology tech Ultrasound tech Echo technologist Mammographer Vascular technologist EEG &amp; EKG tech MRI tech X-ray tech Nuclear med tech Traditional Method Technology Based VMS Managed Services (MSP) Anesthesia tech Certified surgical tech Sterile processing tech Cardiovascular operating room tech Operating room tech Surgical first assistant Traditional Method Technology Based VMS Managed Services (MSP) Case manager Counselor Social worker Clinician Mental health tech Traditional Method Technology Based VMS Managed Services (MSP) Cytotechnologist Medical laboratory tech Medical technologist Histotechnologist Medical laboratory scientist Pathology assistant Lab assistant Traditional Method Technology Based VMS Managed Services (MSP) Pharmacist Pharmacy tech Traditional Method Technology Based VMS Managed Services (MSP) Dental assistant Dental hygienist Traditional Method Technology Based VMS Managed Services (MSP) Emergency medical tech Emergency room tech Paramedic Expand your allied health career with Lifelink As one of the top allied health staffing agencies in the United States, Lifelink Healthcare Staffing is the ideal choice for allied health professionals. With access to the best facilities and top employers in the country, your dedicated recruiter will work with you to find the perfect allied health job based on your experience, qualifications, and needs.   Lifelink Healthcare Staffing has temp-to-perm, direct hire, local and travel assignment options available, allowing you flexibility when considering a job. With so many possibilities, you are sure to find the opportunity that works best for you.   Don&#8217;t wait – apply with us today to get one step closer to securing an amazing position with Lifelink healthcare staffing! Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/ailled-health5.mp4 Applying has never been easier! Meet Frankie Frankie, Lifelink Healthcare Staffing’s virtual assistant, helps allied health professionals through our application process. Once you click the ‘apply’ button, Frankie will guide you through the application by asking you questions and automatically submitting your information, ensuring a hassle-free experience. Find Your Dream Travel Nurse Assignment With our new chat bot, you’ll be able to quickly apply for an allied health job and easily create your profile with Lifelink in a matter of minutes. Our streamlined application process helps experienced allied health professionals find the job of their dreams with Lifelink. Apply Today Earn extra money with Lifelink&#8217;s employee referral program Do you know an allied health professional that is looking for a new job opportunity? Refer them to Lifelink! Our referral bonus program is open to employees and non-employees alike. For every referral you make to Lifelink, you have the chance to earn extra money as a reward for helping us find the best talent out there. Refer your friends, family, or colleagues in the healthcare community to Favorite Healthcare Staffing today! Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/ailled-health6.mp4 My Staff Need Referral Program Help someone find a job and earn rewards in the process. Refer a Friend Fill Out the Form Get Rewards Let&#8217;s Discuss","thumbnail_url":"https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/ailled-health2.png","thumbnail_width":1376,"thumbnail_height":768}