{"version":"1.0","provider_name":"LifeLink","provider_url":"https:\/\/lifelinkhealthtech.com","author_name":"root","author_url":"https:\/\/lifelinkhealthtech.com\/author\/root\/","title":"About Us - LifeLink","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"26RNiJjSJ8\"><a href=\"https:\/\/lifelinkhealthtech.com\/about-us\/\">About Us<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/lifelinkhealthtech.com\/about-us\/embed\/#?secret=26RNiJjSJ8\" width=\"600\" height=\"338\" title=\"&#8220;About Us&#8221; &#8212; LifeLink\" data-secret=\"26RNiJjSJ8\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n<\/script>\n","description":"About Us Connecting Healthcare Talent with Opportunity, Excellence, and Care. Who We Are At My Staff Need, we&#8217;re dedicated to linking people with meaningful work while addressing crucial staffing shortages, ensuring that patients always receive the care they need. Since our founding in 2020, our core value of putting others first and our people-centered approach have shaped our company culture. With decades of experience supporting large managed programs, our team is our greatest strength. We’ve continuously refined our recruitment and delivery model to drive success. My Staff Need has years of experience in the employment services industry, with expertise across all areas of staffing, including MSP\/VMS programs. We&#8217;ve had the opportunity to work on some of the largest and most complex programs nationwide. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/who-we-are.mp4 Our Vision To revolutionize healthcare staffing by connecting top-tier medical professionals with trusted healthcare facilities, ensuring quality patient care and every clinician finds the right opportunity to thrive. Our Mission At My Staff Need, we are committed to bridging the gap between healthcare talent and institutions by delivering seamless, reliable, and innovative staffing solutions. We strive to empower medical professionals with rewarding career opportunities while ensuring healthcare facilities have access to the highest quality workforce, fostering a healthier and more connected world. My Staff Need Referral Program Help someone find a job and earn rewards in the process. Refer a Friend Fill Out the Form Get Rewards Let&#8217;s Discuss Our Commitment to Diversity It is because we have a choice to do. And we have chosen to make diversity a part of everything we do, intrinsic in every aspect of our corporation and inspiring every service we provide. Our diversity Hiring goals are emulated in our recruiting, both internally and for our clients. My Staff Need team has set hiring goals for diverse talent and take pride in Diverse Hiring. Our team of SMEs educate and help corporates understand the Disability Challenges and how can we minimize their impact on hiring and candidate’s future advancement. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/our-commitment-to-diversity.mp4 Reduce Prejudice and Stereotyping My Staff Need has special programs to remove\/reduce the greatest challenge in employment that revolves around prejudice and stereotypes of not allowing a person with disabilities (PWD) to advance to the interview stage of the job application process. We support and maintain long term relations with our candidates for their future advancement. “An immense challenge PWD face on a daily basis is being reminded that they are different, but our team encourages\/motivates their unique talent of whatever workspace they are working in” It is our immense gratitude to share that all corporates have accepted PWDs with open arms and see their ability and not the physical disability. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/reduce-preduice.mp4","thumbnail_url":"https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2021\/03\/01.png","thumbnail_width":120,"thumbnail_height":120}