{"version":"1.0","provider_name":"LifeLink","provider_url":"https:\/\/lifelinkhealthtech.com","author_name":"root","author_url":"https:\/\/lifelinkhealthtech.com\/author\/root\/","title":"Travel Nursing - LifeLink","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"GO7a0RFuvW\"><a href=\"https:\/\/lifelinkhealthtech.com\/travel-nursing\/\">Travel Nursing<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/lifelinkhealthtech.com\/travel-nursing\/embed\/#?secret=GO7a0RFuvW\" width=\"600\" height=\"338\" title=\"&#8220;Travel Nursing&#8221; &#8212; LifeLink\" data-secret=\"GO7a0RFuvW\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n<\/script>\n","description":"Travel Nursing Jobs Go Where You’re Needed. Stay Where You Love with My Staff Need! What are travel nursing jobs? Travel nursing jobs are an attractive option for experienced nurses looking to explore new places and gain professional experience. With travel nursing, advanced practice nurses (APRN), registered nurses (RN), and licensed practical nurses (LPN) have the opportunity to work in different healthcare facilities across the United States on assignments that last anywhere from 4-13 weeks. This shorter time frame often translates into generous pay, as travel RNs and LPNs are in high demand, providing added financial benefits and flexibility for those looking to travel. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/travel-nursing-jobs-1.mp4 Lifelink Healthcare Staffing offers an abundance of travel nursing jobs that are ideal for nurses who want to enjoy the flexibility of a short-term assignment. Travel nursing enables healthcare professionals to earn generous pay while experiencing adventures and exploring the nation. Whether you’re traveling for pleasure, looking for a change in scenery, or taking the opportunity to advance in your career, you can discover your dream job with Lifelink Healthcare Staffing today! Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/travel-nursing2.mp4 How to become a travel nurse Becoming a travel nurse first starts with becoming a licensed nurse. Education requirements depend on the specialty and the employer but usually include having an Associate degree in Nursing (ADN) and successfully passing the NCLEX-RN exam administered by the National Council of State Boards of Nursing to receive your nursing license. Having a Bachelor of Science in Nursing (BSN) could potentially open up more job opportunities. If travel nursing is something you&#8217;re interested in, make sure you have the required education, and an active nursing license to ensure success in this profession. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/how-to-become-travel-nurse-1.mp4 After you have received your nursing license, travel nursing jobs are a great way to take advantage of exciting job opportunities in various parts of the country. To begin working as a travel nurse with Lifelink Healthcare Staffing, you need at least one year of recent work experience as an APRN, RN, or LPN or LVN.  Depending on the assignment and position, travel nurses may also need specialty certifications, including an active Basic Life Support (BLS) certification. Prior experience as a travel nurse is not necessary in order to work with Lifelink, making travel nursing an ideal option for those looking to branch out in their career. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/travel4-1.mp4 The best travel nursing experience starts with Lifelink As one of the top travel nursing agencies in the United States, Lifelink Healthcare Staffing is the ideal choice for healthcare professionals interested in becoming a travel nurse. With a dedicated recruiter, you can be assured that each assignment is selected with your best interests in mind. Your recruiter will work hard to find the perfect travel nursing job for you and will provide you with support throughout the length of your travel nursing assignment.   Make Lifelink Healthcare Staffing your go-to staffing agency for the best travel nursing experience – apply today! Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/best-travel-nurse-1.mp4 Applying has never been easier! Meet Frankie Frankie, Lifelink Healthcare Staffing’s virtual assistant, helps travel nurses through our application process. Once you click the ‘apply’ button, Frankie will guide you through the application by asking you questions and automatically submitting your information, ensuring a hassle-free experience. Find Your Dream Travel Nurse Assignment With our new chat bot, you’ll be able to quickly apply for a travel nurse assignment and easily create your profile with Lifelink in a matter of minutes. Our streamlined application process helps experienced travel nurses find the job of their dreams with Lifelink. Apply Today We provide travel nursing jobs in every state – find your perfect fit today! If you are an experienced and licensed nurse looking for the chance to travel, Lifelink Healthcare Staffing has got you covered! We offer unique nursing positions in some of the most sought-after destinations in the U.S. From busy hospitals in California to bustling clinics in New York, nurses have the chance to explore new environments and healthcare facilities when traveling with Lifelink. If you&#8217;re looking for travel opportunities with an added layer of convenience, Lifelink also has travel nursing jobs in states that recognize the Nurse Licensure Compact (NLC) to make travel nursing even easier. With this type of license, you have the added convenience of exploring other states while still providing excellent patient care without having to worry about obtaining additional licensure. With exciting possibilities for adventure, new professional experiences, and personal growth, now is the perfect time to take your nursing career to the next level. Lifelink can make your travel dreams come true with top-notch job placements in the best healthcare facilities and destinations around the United States – connect with a recruiter today! Learn More My Staff Need Referral Program Help someone find a job and earn rewards in the process. Refer a Friend Fill Out the Form Get Rewards Let&#8217;s Discuss","thumbnail_url":"https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/NLC-Enacted-Awaiting-Implementation.png","thumbnail_width":1376,"thumbnail_height":768}