{"version":"1.0","provider_name":"LifeLink","provider_url":"https:\/\/lifelinkhealthtech.com","author_name":"root","author_url":"https:\/\/lifelinkhealthtech.com\/author\/root\/","title":"Non-Clinical - LifeLink","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"E06q4JHn8f\"><a href=\"https:\/\/lifelinkhealthtech.com\/non-clinical\/\">Non-Clinical<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/lifelinkhealthtech.com\/non-clinical\/embed\/#?secret=E06q4JHn8f\" width=\"600\" height=\"338\" title=\"&#8220;Non-Clinical&#8221; &#8212; LifeLink\" data-secret=\"E06q4JHn8f\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n<\/script>\n","description":"Non-Clinical Healthcare Jobs Where Healthcare Meets Management – Making a Difference Every Day. What are non-clinical careers in healthcare? Non-clinical jobs in the healthcare field are a critical part of the medical system. The importance of non-clinical jobs in healthcare is often overlooked, but those working in non-clinical positions play a vital part in helping hospitals and other medical facilities run efficiently so that the clinical staff can focus on providing the best care for patients.  Lifelink Healthcare Staffing provides non-clinical professionals exciting career opportunities at top healthcare organizations nationwide. With multiple employment options available including contract work, temp to perm opportunities, and direct hire jobs, our dedicated recruiters can help you find the perfect non-clinical healthcare job near you! Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/non-clinical2.mp4 Non-clinical positions typically do not involve direct patient care and usually revolve around anything behind the scenes at hospitals and other healthcare facilities. While some non-clinical jobs are specific to healthcare like hospital executives or medical billers and coders, many jobs in departments like human resources, information technology (IT), and facility maintenance exist in other industries. These non-clinical careers generally do not require prior healthcare experience and are often an excellent way to get into the medical field leading to a rewarding and meaningful career in the medical profession. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/non-clinical3-1.mp4 Explore non-clinical healthcare jobs with Lifelink The types of non-clinical roles available are as vast as the range of unique requirements and skill sets needed to work in these positions. Our recruiters are experienced with navigating the different backgrounds, certifications, and degrees healthcare facilities require for employment. At Lifelink, we know how important your career is, and we work with you to select the job that meets your needs and utilizes your individual experience. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/explore-non-clinical3.mp4 List of non-clinical healthcare jobs Administrative Environmental Services Facilities Finance \/ Accounting Food and Nutrition Services Health &amp; Information Management Human Resources (HR) Information Technology (IT) Legal Logistics &amp; Transportation Marketing Security Traditional Method Technology Based VMS Managed Services (MSP) Administration manager COVID screener Patient registrar Administrative assistant Customer service representative Receptionist Call center representative Executive assistant Scheduler Cancer registrar Front desk coordinator Secretary Case management assistant Front desk coordinator Staffing coordinator Operations coordinator Traditional Method Technology Based VMS Managed Services (MSP) Custodian Environmental services lead Linen associate Environmental services aide Housekeeper Surgical housekeeping specialist Traditional Method Technology Based VMS Managed Services (MSP) Equipment processer Facilities manager Operator Equipment repair technician Maintenance worker Systems operator Traditional Method Technology Based VMS Managed Services (MSP) Accountant Business analyst Finance clerk Accounts payable clerk Claims processor Medical biller Accounts receivable clerk Collections representative Payroll coordinator Billing specialist Data analyst Purchasing assistant Traditional Method Technology Based VMS Managed Services (MSP) Cook Dishwasher Nutritional services aide Dietary aide Traditional Method Technology Based VMS Managed Services (MSP) Auditor Data entry clerk Medical scribe Compliance coordinator Health information specialist Medical transcriptionist Credential coordinator Medical coder Project manager Traditional Method Technology Based VMS Managed Services (MSP) Benefits coordinator Human resources assistant Talent acquisition partner Compensation analyst Recruiter Traditional Method Technology Based VMS Managed Services (MSP) Application analyst Desktop support technician Project assistant Business analyst Developer Project manager Data analyst Programmer Systems administrator Traditional Method Technology Based VMS Managed Services (MSP) Lawyer Legal assistant Paralegal Traditional Method Technology Based VMS Managed Services (MSP) Driver Patient transporter Warehouse aide Materials associate Supply clerk Warehouse worker Traditional Method Technology Based VMS Managed Services (MSP) Communications coordinator Graphic designer Public relations Communications specialist Marketing coordinator Social media coordinator Traditional Method Technology Based VMS Managed Services (MSP) Safety officer Security guard Traditional Method Technology Based VMS Managed Services (MSP) Administration manager COVID screener Patient registrar Administrative assistant Customer service representative Receptionist Call center representative Executive assistant Scheduler Cancer registrar Front desk coordinator Secretary Case management assistant Front desk coordinator Staffing coordinator Operations coordinator Traditional Method Technology Based VMS Managed Services (MSP) Custodian Environmental services lead Linen associate Environmental services aide Housekeeper Surgical housekeeping specialist Traditional Method Technology Based VMS Managed Services (MSP) Equipment processer Facilities manager Operator Equipment repair technician Maintenance worker Systems operator Traditional Method Technology Based VMS Managed Services (MSP) Accountant Business analyst Finance clerk Accounts payable clerk Claims processor Medical biller Accounts receivable clerk Collections representative Payroll coordinator Billing specialist Data analyst Purchasing assistant Traditional Method Technology Based VMS Managed Services (MSP) Cook Dishwasher Nutritional services aide Dietary aide Traditional Method Technology Based VMS Managed Services (MSP) Auditor Data entry clerk Medical scribe Compliance coordinator Health information specialist Medical transcriptionist Credential coordinator Medical coder Project manager Traditional Method Technology Based VMS Managed Services (MSP) Benefits coordinator Human resources assistant Talent acquisition partner Compensation analyst Recruiter Traditional Method Technology Based VMS Managed Services (MSP) Application analyst Desktop support technician Project assistant Business analyst Developer Project manager Data analyst Programmer Systems administrator Traditional Method Technology Based VMS Managed Services (MSP) Lawyer Legal assistant Paralegal Traditional Method Technology Based VMS Managed Services (MSP) Driver Patient transporter Warehouse aide Materials associate Supply clerk Warehouse worker Traditional Method Technology Based VMS Managed Services (MSP) Communications coordinator Graphic designer Public relations Communications specialist Marketing coordinator Social media coordinator Traditional Method Technology Based VMS Managed Services (MSP) Safety officer Security guard Applying has never been easier! Meet Frankie Frankie, Lifelink Healthcare Staffing’s virtual assistant, helps allied health professionals through our application process. Once you click the ‘apply’ button, Frankie will guide you through the application by asking you questions and automatically submitting your information, ensuring a hassle-free experience. Find Your Dream Travel Nurse Assignment With our new chat bot, you’ll be able to quickly apply for an allied health job and easily create your profile with Lifelink in a matter of minutes. Our streamlined application process helps experienced allied health professionals find the job of their dreams with Lifelink. Apply Today Experience the advantage of working with Lifelink Our streamlined application process makes onboarding with Lifelink easy Are you looking for a new job in your healthcare career? Lifelink can assist you in finding a role best suited to your experience and needs. Our easy application process takes","thumbnail_url":"https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2021\/03\/01.png","thumbnail_width":120,"thumbnail_height":120}