{"version":"1.0","provider_name":"LifeLink","provider_url":"https:\/\/lifelinkhealthtech.com","author_name":"root","author_url":"https:\/\/lifelinkhealthtech.com\/author\/root\/","title":"Privacy Policy - LifeLink","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"eZtmTvktOF\"><a href=\"https:\/\/lifelinkhealthtech.com\/privacy-policy\/\">Privacy Policy<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/lifelinkhealthtech.com\/privacy-policy\/embed\/#?secret=eZtmTvktOF\" width=\"600\" height=\"338\" title=\"&#8220;Privacy Policy&#8221; &#8212; LifeLink\" data-secret=\"eZtmTvktOF\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n<\/script>\n","description":"Privacy Policy Effective Date: April 1, 2021 My Staff Need (“we,” “us,” or “our”) is committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your personal data when you visit and use our website, www.lifelinkhealthtech.com (“Service”). By accessing or using our Service, you agree to the terms of this Privacy Policy. If you do not agree with the practices described here, please refrain from using our Service. 1. Information We Collect We collect different types of information to provide and improve our Service, including: 1.1 Personal Data When you use our Service, we may ask for personally identifiable information that allows us to contact or identify you. This includes but is not limited to: Name (First and Last) Email Address Phone Number Mailing Address (Street, City, State, ZIP Code) Cookies and Usage Data 1.2 Usage Data We may collect information about how you interact with our Service, such as: IP Address Browser Type and Version Pages Visited on Our Website Time and Date of Visit Time Spent on Pages Device Identifiers and Diagnostics 1.3 Cookies and Tracking Technologies We use cookies and similar tracking technologies to enhance your browsing experience and analyze usage patterns. Cookies are small data files stored on your device. You can configure your browser to refuse cookies, but this may impact certain functionalities of our Service. Types of Cookies We Use: Session Cookies: Essential for operating our Service. Preference Cookies: Store your preferences and settings. Security Cookies: Enhance security and prevent fraudulent activity. 2. How We Use Your Data We collect and use your data for the following purposes: To provide, maintain, and improve our Service To notify you about changes or updates to our Service To enable participation in interactive features of our website To provide customer support and respond to inquiries To analyze and optimize user experience To monitor security and detect fraud or technical issues 3. Data Transfers and Security 3.1 Data Transfers Your personal data may be processed and stored outside your state, country, or jurisdiction where data protection laws may differ. By submitting your data, you consent to this transfer. We implement strict security measures to protect your data, ensuring that no transfers occur without appropriate safeguards. 3.2 Data Security We take reasonable steps to protect your personal data. However, no method of electronic transmission or storage is 100% secure. While we strive to use commercially acceptable security measures, we cannot guarantee absolute protection against unauthorized access. 4. Disclosure of Data We may disclose your data when necessary to: Comply with legal obligations Protect the rights and property of My Staff Need Prevent fraudulent activities or security threats Ensure the safety of our users and the public Defend against legal claims or liabilities 5. Third-Party Services We may work with third-party service providers to facilitate our operations. These providers are given access to personal data only to perform tasks on our behalf and are contractually obligated to protect it. 5.1 Analytics We use Google Analytics to track and report website traffic. This helps us understand user behavior and improve our Service. To opt out of Google Analytics tracking, you can install the Google Analytics opt-out browser add-on. More information is available at Google’s Privacy Policy. 5.2 External Links Our website may contain links to third-party websites. We are not responsible for their content, privacy policies, or practices. Please review their policies before providing any personal data. 6. Your Rights and Choices 6.1 California Consumer Privacy Act (CCPA) Rights If you are a California resident, you have the right to: Request details on data collection and usage Request deletion of your personal data Opt out of the sale of your data (we do not sell personal data) To exercise these rights, contact us at info@lifelinkhealthtech.com. We will respond within 30 days. 6.2 General Data Protection Regulation (GDPR) Rights If you are a resident of the European Union, you have the right to: Access, update, or delete your personal data Object to data processing under certain conditions Request data portability Restrict or withdraw consent for data processing To exercise these rights, contact us at info@lifelinkhealthtech.com. 7. No Information Disclosure to Third Parties : No mobile information will be shared with third parties\/affiliates for marketing\/promotional purposes. All other categories exclude text messaging originator opt-in data and consent; this information will not be shared with any third parties. 8. Children’s Privacy Our Service is not intended for individuals under 18. We do not knowingly collect data from minors. If you believe a child has provided personal information, contact us immediately, and we will take steps to remove it. 9. Changes to This Privacy Policy We may update this Privacy Policy periodically. Any changes will be posted on this page, and where appropriate, we will notify users via email. We encourage you to review this policy regularly to stay informed. 10. Contact Us If you have any questions or concerns about this Privacy Policy, please contact us: My Staff Need LLC1603 Capitol Ave, Suite 413g-1061Cheyenne, WY 82001Email: info@lifelinkhealthtech.comPhone: +13074741307"}