{"version":"1.0","provider_name":"LifeLink","provider_url":"https:\/\/lifelinkhealthtech.com","author_name":"root","author_url":"https:\/\/lifelinkhealthtech.com\/author\/root\/","title":"Healthcare Careers - LifeLink","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"Clu6vlts9w\"><a href=\"https:\/\/lifelinkhealthtech.com\/healthcare-careers\/\">Healthcare Careers<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/lifelinkhealthtech.com\/healthcare-careers\/embed\/#?secret=Clu6vlts9w\" width=\"600\" height=\"338\" title=\"&#8220;Healthcare Careers&#8221; &#8212; LifeLink\" data-secret=\"Clu6vlts9w\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n<\/script>\n","description":"Healthcare Careers Healing Hands, Bright Professionals Making a Difference, One Patient at a Time. The top staffing agency for healthcare professionals nationwide At My Staff Need, we know how important your career is to you. We partner with the best healthcare organizations across the country to provide exceptional career opportunities to experienced nursing, allied health, and non-clinical professionals. Whether you are looking for more flexibility to allow for a better work-life balance or for your next big adventure in your career, Lifelink can help you find your dream job. Nursing My Staff Need is committed to providing career opportunities for nurses across various specialties. While we are a growing name in healthcare staffing, our mission is to connect skilled nursing professionals—including registered nurses (RNs), licensed practical nurses (LPNs), licensed vocational nurses (LVNs), certified nursing assistants (CNAs), and advanced practice nurses like nurse practitioners (NPs) and physician assistants (PAs)—with rewarding opportunities nationwide. Explore our travel nursing and per diem nursing options to find the perfect fit for your career. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/healthcare2-1.mp4 Allied Health At My Staff Need, we are dedicated to connecting allied health professionals with rewarding career opportunities. Whether your expertise lies in rehabilitation and therapy, radiology and imaging, social work, behavioral health, pharmaceuticals, or dentistry, we can help you find the perfect role. Our goal is to support your professional growth by providing hands-on experience in diverse healthcare settings. Explore opportunities with My Staff Need and take the next step in your allied health career. Learn More Non-Clinical In the healthcare field, non-clinical professionals play a critical role in the operation of the medical system. Our dedicated recruiters are experienced in navigating the unique responsibilities non-clinical personnel provide the healthcare community. Whether you are in human resources, information technology (IT), or environmental services, we can find your dream job at top healthcare facilities near you. With Lifelink , you’ll be able to work at several different locations including hospitals, physician offices, and long-term care facilities across the country. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/healthcare4-1.mp4 Flexible employment options to fit your needs At My Staff Need, we pride ourselves on providing a range of employment options to fit your needs and schedule. We offer permanent direct hire jobs, as needed per diem jobs, and contract assignments including short-term and long-term travel and local assignments. Direct Hire Direct hire jobs are an excellent option if you are looking for a part-time or full-time permanent job as a staff nurse or a healthcare professional. Our placement consultants match you with employers in need of committed and skilled staff, allowing you to find the right permanent job providing you with longevity and stability. Lifelink has direct hire jobs for nurse anesthetists, nurse practitioners, registered nurses, licensed practical nurses, certified nursing assistants, front and back-office staff, and a wide range allied health roles including medical assistants, certified surgical technicians, and more. Find your dream direct hire job with Lifelink today! Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/healthcare5-1.mp4 Per Diem Per diem, or PRN, work allows nurses to pick up shifts on an as-needed basis, sometimes across multiple healthcare facilities, without committing to full-time employment. Per diem work offers high pay, flexibility, and the ability to choose where you work and when. With per diem nursing, you can control and manage your schedule by choosing the days and hours you work on a per-shift basis. No matter where you are located, with branch offices located across the United States, Lifelink can help you find the best PRN nursing jobs near you. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/healthcare6-1.mp4 Travel Assignments Short-term or long-term travel assignments give travel nurses and allied health professionals the opportunity to work in different healthcare facilities nationwide on assignments that typically last anywhere from 4-13 weeks. While temporary, travel assignments offer you higher pay rates, the flexibility of choosing where you want to work, and the ability to develop your skills at top facilities including teaching hospitals, acute care hospitals, medical centers, and more. Explore the country while you advance your healthcare career on a travel assignment with Lifelink! Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/healthcare7-1.mp4 Non-traditional employment opportunities with Lifelink Healthcare Staffing Unlike most of our healthcare staffing competitors, Lifelink offers nursing, allied health, and non-clinical professionals a full range of employment options from traditional travel nursing and per diem work, to more niche opportunities like school nursing, corrections, and government assignments for emergency management and disaster response.  School Nursing School nurses and healthcare professionals are crucial to creating a safe and healthy learning environment by providing healthcare services to students and faculty in schools, colleges, and universities. Responsible for treating illnesses and injuries on site, dispensing medications and administering injections, providing medical supervision and health advice, school nurses provide necessary care to members of our communities. Interested in school nurse jobs near you? Search our current job openings or apply with Lifelink today! Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/healthcare8.mp4 Correctional Nursing Correctional nurses and healthcare professionals play a vital role in healthcare by providing nursing care that promotes, protects, and optimizes the health of individuals under the jurisdiction of the justice system. From assessing healthcare needs to providing healthcare treatments, such as pain management and mental health interventions, correctional nurses have a wide scope of responsibilities and serve as advocates for their patients. They strive to reduce suffering through diagnosis and treatment and by respecting the dignity of everyone they care for. Looking for correctional nursing jobs near you? Search our current job openings or apply with Lifelink today! Learn More Emergency management and disaster response My Staff Need has provided nursing, allied health, and non-clinical personnel support for government and state staffing needs for years. Our employees have been part of disaster relief response units for hurricanes, tornadoes, and floods; emergency shelters for gas explosions and unaccompanied minors; emergency response units for COVID testing sites, vaccine administration, infection control, and for staffing shortages nationwide. With our people-centric mentality, combined with a core value focused on always putting others before self, Lifelink is dedicated to supporting our communities in crisis. For more information visit our emergency services page. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/healthcare10-1.mp4","thumbnail_url":"http:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/healthcare3-1024x572.png"}