{"version":"1.0","provider_name":"LifeLink","provider_url":"https:\/\/lifelinkhealthtech.com","author_name":"root","author_url":"https:\/\/lifelinkhealthtech.com\/author\/root\/","title":"LOCUM TENENS - LifeLink","type":"rich","width":600,"height":338,"html":"<blockquote class=\"wp-embedded-content\" data-secret=\"7WwYKCwagy\"><a href=\"https:\/\/lifelinkhealthtech.com\/locum-tenens\/\">LOCUM TENENS<\/a><\/blockquote><iframe sandbox=\"allow-scripts\" security=\"restricted\" src=\"https:\/\/lifelinkhealthtech.com\/locum-tenens\/embed\/#?secret=7WwYKCwagy\" width=\"600\" height=\"338\" title=\"&#8220;LOCUM TENENS&#8221; &#8212; LifeLink\" data-secret=\"7WwYKCwagy\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" class=\"wp-embedded-content\"><\/iframe><script>\n\/*! This file is auto-generated *\/\n!function(d,l){\"use strict\";l.querySelector&&d.addEventListener&&\"undefined\"!=typeof URL&&(d.wp=d.wp||{},d.wp.receiveEmbedMessage||(d.wp.receiveEmbedMessage=function(e){var t=e.data;if((t||t.secret||t.message||t.value)&&!\/[^a-zA-Z0-9]\/.test(t.secret)){for(var s,r,n,a=l.querySelectorAll('iframe[data-secret=\"'+t.secret+'\"]'),o=l.querySelectorAll('blockquote[data-secret=\"'+t.secret+'\"]'),c=new RegExp(\"^https?:$\",\"i\"),i=0;i<o.length;i++)o[i].style.display=\"none\";for(i=0;i<a.length;i++)s=a[i],e.source===s.contentWindow&&(s.removeAttribute(\"style\"),\"height\"===t.message?(1e3<(r=parseInt(t.value,10))?r=1e3:~~r<200&&(r=200),s.height=r):\"link\"===t.message&&(r=new URL(s.getAttribute(\"src\")),n=new URL(t.value),c.test(n.protocol))&&n.host===r.host&&l.activeElement===s&&(d.top.location.href=t.value))}},d.addEventListener(\"message\",d.wp.receiveEmbedMessage,!1),l.addEventListener(\"DOMContentLoaded\",function(){for(var e,t,s=l.querySelectorAll(\"iframe.wp-embedded-content\"),r=0;r<s.length;r++)(t=(e=s[r]).getAttribute(\"data-secret\"))||(t=Math.random().toString(36).substring(2,12),e.src+=\"#?secret=\"+t,e.setAttribute(\"data-secret\",t)),e.contentWindow.postMessage({message:\"ready\",secret:t},\"*\")},!1)))}(window,document);\n<\/script>\n","description":"Locum Tenens Bridging Healthcare Gaps with Trusted Locum Tenens. Your Trusted Locum Tenens Partner My Staff Need Locums connects physicians and advanced practitioners with top healthcare facilities nationwide. As a leading staffing and workforce solutions provider, we ensure a smooth, transparent experience for both providers and employers. Whether you&#8217;re a facility seeking skilled professionals or a provider looking for the perfect locum tenens opportunity, we make the process simple and efficient. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/your-trusted-locum-tenens-partner-1.mp4 Specialty positions offered We take the time to get to know our providers and facilities so we can ensure optimal placements for all involved. We offer positions for physicians, physician assistants, CRNAs and NPs in the following specialties: Anesthesia\/CRNA Surgery Primary Care\/Urgent Care\/Occupational Medicine Behavioral Health Emergency Medicine (ABEM, IM, FP &#038; GP) Hospitalist\/Intensivist IM Sub-Specialties Radiology Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/Locum-tenens-banner.mp4 Simple &#038; Seamless Applications! Your Next Opportunity is Waiting Explore our jobs page to find nationwide positions, including permanent and travel roles. Let us help you take the next step in your career. Work on Your Terms Flexibility matters. Whether you&#8217;re a parent, student, or recent grad, we offer options tailored to your lifestyle. Let’s find the perfect fit together. Partnering with the Best We’re honored to work with top-tier healthcare organizations across the U.S. Join our network and become part of an elite team making a difference! Apply Today Is Locum Tenens the Right Fit for You? Healthcare professionals choose locum tenens for various reasons. It’s a great way to explore different facilities and locations without committing to a full-time role. With flexible assignments ranging from a single shift to several months, you’re in control of your career path. Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/locum-tenens-the-right-fir-1.mp4 Why Consider Locum Tenens? Boost Your Earnings Expand Your Expertise Avoid Career Burnout Test the Waters Before Committing Travel &#038; Get Paid Grow Your Professional Network Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/why-consider-locum-tenens-1.mp4 Hassle-Free Experience We handle your housing and travel arrangements at no cost to you, ensuring a smooth and stress-free assignment. Seamless Travel &#038; Lodging – Our team coordinates everything, with 24\/7 support for any last-minute adjustments. Effortless Credentialing – We take care of all requirements to get you fully credentialed and privileged. Licensing Assistance – Need a new state license? We’ll guide you through the process and even cover the cost. Focus on your career—we’ll handle the rest! Learn More https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/03\/hassle-free-experienc-1.mp4 Competitive Pay &#038; Comprehensive Benefits At My Staff Need, we value you—and that includes ensuring you receive top-tier compensation and benefits so you can focus on growing your career with confidence. Industry Leading Pay Fully Covered Medical Malpractice Fully Covered Travel &#038; Housing 24\/7 Staff Support Full Travel Help Desk Service Weekly Direct Deposit &#038; EZ Timekeeping Risk Management Dedicated Care Consultant Exclusive Loyalty &#038; Referal Program Free Tax Returns* Free Credentialing &#038; Licensing Dedicated Clinical Support Exclusive Employee Discounts More perks. More savings. More of what makes you happy. More savings, more perks—just for you! Enjoy special deals on the products, services, and experiences that enhance your life. Hotels &#038; Flights Shopping &#038; Apparel Car Rentals &#038; Auto Deals Movies, Events &#038; Theme Parks Groceries &#038; Gift Cards Fitness Memberships &#038; More! My Staff Need Referral Program Help someone find a job and earn rewards in the process. Refer a Friend Fill Out the Form Get Rewards Let&#8217;s Discuss","thumbnail_url":"https:\/\/lifelinkhealthtech.com\/wp-content\/uploads\/2025\/04\/operation.png","thumbnail_width":512,"thumbnail_height":512}